{"data":{"site":{"siteMetadata":{"title":"Aaron Bosley","author":"Aaron Bosley"}},"markdownRemark":{"id":"f13d4d42-9bbe-5990-bff9-f9d8bac5d03c","excerpt":"Lets discuss the front-end stack for TrainingWall! Fortunately us web developers have a few solid options when it comes to cross platform mobile app development…","html":"<h2>Lets discuss the front-end stack for TrainingWall!</h2>\n<p>Fortunately us web developers have a few solid options when it comes to cross platform mobile app development</p>\n<ul>\n<li>Flutter - <em>Written in Dart</em></li>\n<li>Cordova - <em>WebView with access to native API’s</em></li>\n<li>Ionic</li>\n<li>NativeScript</li>\n<li>React Native</li>\n</ul>\n<p>*I’ve included <strong><em>Flutter</em></strong> in the list as it is written in <strong>Dart</strong> which has web development offerings for both client and server-side.*</p>\n<h2>Let’s start with Flutter</h2>\n<p><strong>Flutter</strong> is Google’s offering to cross platform app development, it’s fresh, fast and has a growing community.</p>\n<p>Sadly I didn’t have the time to sink into this framework along with a new language, I was already learning a new style of development!</p>\n<p>The growing community and the ever increasing set of re-usable widgets and the strong integration potential with <strong>Material Design</strong> is leading <strong>Flutter</strong> and Dart to continual growth and definitely leaves it in the running for this app. One day I’ll find the time!</p>\n<h2>Cordova, Apache’s offering</h2>\n<p>This nifty little framework boasts a vast array of plugins and an interesting architectural design. I really like how approachable this framework is as a web developer. Writing HTML, CSS and JS comes like second nature and in the modern age of mobile first development, once you’re past the initial set up you feel empowered to crack on.</p>\n<p>Access to the camera, device location, orientation, file system and many other native API’s can be handled relatively painlessly with plugins from the community.</p>\n<h2>Ionic</h2>\n<p>I didn’t really investigate <strong>Ionic</strong> as it doesn’t have quite the same sized community as some of the other frameworks and platforms in the list.</p>\n<h2>NativeScript</h2>\n<p>I also didn’t really dig into <strong>NativeScript</strong> very deeply as, at the time, I was more interested in other technologies than <strong>Angular</strong> for personal projects as I was using it for work.</p>\n<h2>React Native</h2>\n<p><strong>React Native</strong> is Facebooks offering to cross platform applications. Since release in <strong>Feb 2015</strong> over 75k GitHub stars have been awarded to <strong>React Native</strong>.</p>\n<p>Community offerings and easy to use UI libraries were a big draw for me when building my first mobile offering, this left an easy choice… Not to mention I’ve worked with <strong>React</strong> before which shrunk the learning curve a little.</p>\n<p><strong>Next up:</strong> <em>Authentication and Authorization</em></p>","frontmatter":{"title":"TrainingWall - The Tech Stack (front-end)","date":"May 08, 2019","category":"Front-End","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/trainingwall-the-tech-stack-part-two/","previous":{"fields":{"slug":"/trainingwall--the-tech-stack-part-one/"},"frontmatter":{"title":"TrainingWall - The Tech Stack (back-end)"}},"next":{"fields":{"slug":"/trainingwall-authentication-and-authorization/"},"frontmatter":{"title":"TrainingWall - Authentication and Authorization"}}}}