{"data":{"site":{"siteMetadata":{"title":"Aaron Bosley","author":"Aaron Bosley"}},"markdownRemark":{"id":"58603278-30fe-52e7-9c77-1ad7e38ceaaf","excerpt":"In this post I’m going to cover the Tech Stack I chose as a back-end for my app, TrainingWall. When starting a new project, commercial or personal, I’m always…","html":"<h2>In this post I’m going to cover the Tech Stack I chose as a back-end for my app, TrainingWall.</h2>\n<p>When starting a new project, commercial or personal, I’m always presented with the question:</p>\n<blockquote>\n<p>What tech stack do I use for this?</p>\n</blockquote>\n<p>Sometimes it’s a very simple and easy question to answer, <em>”<strong>What you know best</strong>”</em> other times it can be a real challenge and the initial investment in architectural planning can put me off a project.</p>\n<p>When working on my own personal projects I tend to be a bit more exploratory and implement technologies I’m not as familiar with. Do I value my personal time less than my work time, or is it just more fun to learn new things, new ways and at least attempt to keep up to date with the ever increasing pace of JavaScript and web development practices?</p>\n<p>To answer this question I looked at the outcomes I want my backend to deliver.</p>\n<h2>Requirements</h2>\n<ul>\n<li>REST API - <em>Could easily, and probably will in the future, add a GraphQL layer.</em></li>\n<li>Automated testing</li>\n<li>Authentication</li>\n<li>Authorization</li>\n<li>Connects to a database</li>\n</ul>\n<p>That’s a very generic and rather rudimentary set of requirements right? But it gives a good start and besides, every app should be test-able!</p>\n<p>I’ve almost exclusively worked with JavaScript since graduating university and love the language along with its incredible community of dedicated developers, so I chose <strong>NodeJS</strong> to write the server, <strong>ExpressJS</strong> to handle my API endpoints and routing, <strong>MongoDB</strong> as my database and <strong>Mocha w Chai</strong> as my testing framework.</p>\n<p><strong>NodeJS</strong> is a very well supported platform with an incredible number of open source packages, everything from indenting your code to machine learning libraries. This incredible eco-system leaves you with a wealth of packages to choose from that can do pretty much anything, certainly an overwhelming quantity for any newbie. I chose to stick with <strong>v8.13.^</strong> at the time of writing due to package support.</p>\n<h3>Is it important to choose a long term support (LTS) version?</h3>\n<p>Support for <strong>NodeJS</strong> is similar to that of Linux, a distribution or release version is chosen, and scheduled, for <em>long term support</em> and it therefore receives <em>long term support</em> for packages included with the release version and larger packages tend to stick with this support cycle. I say tend to as some packages aren’t as well maintained as others. Keep in mind that a lot of packages are maintained by the community, people like you and I, just more generous!</p>\n<h3>Now that I’ve chosen NodeJS, why did I choose ExpressJS over, say, Koa?</h3>\n<p>Choosing <strong>Koa</strong> may have been a smart choice if I was interested in following the state of JavaScripts surveys. They plug the average wage for <strong>Koa</strong> developers as XYZ% higher than <strong>ExpressJS</strong> devs, but life is not all about money. I could’ve spent my time learning <strong>Koa</strong> or I could work towards delivering the project and my knowledge of <strong>ExpressJS</strong> is greater. The efficiencies brought by <strong>Koa</strong> aren’t needed for this application, the expected use is very low and not intensive.</p>\n<h3>We have a server technology, and a set of HTTP utilities, why MongoDB?</h3>\n<p>One of the biggest advantages I’ve found when using <strong>MongoDB</strong> and <strong>Atlas</strong> has got to be the incredible speed with which you can create schemas and adapt them to any use case, even halfway through development.</p>\n<p>I put a large value on this factor when I’m building a prototype, schemas are likely to evolve during development, they’re also very likely to evolve once the first version releases to production! It takes a while to stabilise a database schema when you’re one man. <em>Nobody is faultless, we all overlook things.</em></p>\n<p><strong>Atlas</strong> has a very good free tier that enables you to get up and running with a development and production database without any hassle.</p>\n<p>Creating schemas for a <em>“schema-less database”</em> seems odd, but it isn’t. It’s normal to want structure, that’s what a database is after all, a bunch of data points organised in a query-able and predictable manner.</p>\n<p>I’ve worked with two different frameworks that apply schemas to <strong>MongoDB</strong> databases, <strong>Mongoose</strong> and <strong>LoopBack</strong>. <strong>LoopBack</strong>  is very opinionated in database and endpoint structuring that I wanted, it would’ve been a fine fit and the useful CLI tools would’ve made for faster development. <strong>LoopBack</strong> is also built upon both <strong>Mongoose</strong> and <strong>ExpressJS</strong>, so I chose to work with the building blocks and apply my own opinions.</p>\n<h3>This leaves the testing framework</h3>\n<p><strong>Mocha</strong> is a very simple to read testing framework and has a variety of different extensions but most of all, it’s my favourite coffee related drink. The little things. </p>\n<p>To clarify, I’m not a fan of <strong>Chai</strong> in my coffee but I’m more than happy to use it for HTTP testing!</p>\n<p><strong>Next up:</strong> <em>The Tech Stack (front-end)</em></p>","frontmatter":{"title":"TrainingWall - The Tech Stack (back-end)","date":"May 08, 2019","category":"Back-End","description":"In this post I'm going to cover the Tech Stack I chose as a back-end for my app, TrainingWall."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/trainingwall--the-tech-stack-part-one/","previous":null,"next":{"fields":{"slug":"/trainingwall-the-tech-stack-part-two/"},"frontmatter":{"title":"TrainingWall - The Tech Stack (front-end)"}}}}